Revit 2026 API

# PromptForFamilyInstancePlacementOptions(PromptForFamilyInstancePlacementOptions) Constructor

---

Creates a copy of an existing options object.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PromptForFamilyInstancePlacementOptions(
	PromptForFamilyInstancePlacementOptions other
)
```
```vb
Public Sub New (
	other As PromptForFamilyInstancePlacementOptions
)
```
```cpp
public:
PromptForFamilyInstancePlacementOptions(
	PromptForFamilyInstancePlacementOptions^ other
)
```
```fsharp
new :
        other : PromptForFamilyInstancePlacementOptions -> PromptForFamilyInstancePlacementOptions
```

#### Parameters

other PromptForFamilyInstancePlacementOptions
     The options object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PromptForFamilyInstancePlacementOptions Class

PromptForFamilyInstancePlacementOptions Overload

Autodesk.Revit.UI Namespace